# ðŸ”Ž Exploration and cleaning 
### Dataset: Flight Customers Activity (`Customer_Flight_Analysis.csv`) and Customer Profiles (`Customer_Loyalty_History.csv`)  

**Objective:** Analyze the data structure, identify missing values, and detect incomplete information in columns.

In [32]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

### Customers Flight Activity

In [40]:
pd.set_option('display.max_columns', None) 

df_flight_activity = pd.read_csv('../data/raw/Customer_Flight_Activity.csv', index_col=0)

df_flight_activity.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [4]:
df_flight_activity.shape

(405624, 9)

In [3]:
df_flight_activity.info()

<class 'pandas.core.frame.DataFrame'>
Index: 405624 entries, 100018 to 999986
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Year                         405624 non-null  int64
 1   Month                        405624 non-null  int64
 2   Flights Booked               405624 non-null  int64
 3   Flights with Companions      405624 non-null  int64
 4   Total Flights                405624 non-null  int64
 5   Distance                     405624 non-null  int64
 6   Points Accumulated           405624 non-null  float64
 7   Points Redeemed              405624 non-null  int64
 8   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(8)
memory usage: 30.9 MB

In [12]:
df_flight_activity[df_flight_activity.duplicated()].head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100272,2017,1,0,0,0,0,0.0,0,0
100301,2017,1,0,0,0,0,0.0,0,0
100364,2017,1,0,0,0,0,0.0,0,0
100380,2017,1,0,0,0,0,0.0,0,0
100504,2017,1,0,0,0,0,0.0,0,0

In [26]:
df_flight_activity[df_flight_activity.index.duplicated(keep=False)].sort_index().head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100018,2018,12,17,6,23,4945,494.0,0,0
100018,2017,12,6,0,6,1908,190.0,0,0
100018,2017,7,10,0,10,3870,387.0,0,0
100018,2018,6,0,0,0,0,0.0,0,0

In [ ]:
# Let's check nulls 

df_flight_activity.isna().sum()/df_flight_activity.shape[0]*100

Year                           0.0
Month                          0.0
Flights Booked                 0.0
Flights with Companions        0.0
Total Flights                  0.0
Distance                       0.0
Points Accumulated             0.0
Points Redeemed                0.0
Dollar Cost Points Redeemed    0.0
dtype: float64

In [ ]:
df_flight_activity[['Year', 'Month']].agg([max, min])

     Year  Month
max  2018     12
min  2017      1

In [39]:
df_flight_activity.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [64]:
# Exploring 'Total Flights' and 'Flights Booked'

df_flight_activity[df_flight_activity['Total Flights'] < df_flight_activity['Flights Booked']].head()

Empty DataFrame
Columns: [Year, Month, Flights Booked, Flights with Companions, Total Flights, Distance, Points Accumulated, Points Redeemed, Dollar Cost Points Redeemed]
Index: []

In [71]:
# Exploring Points columns 

df_points = df_flight_activity[df_flight_activity['Points Redeemed'] > df_flight_activity['Points Accumulated']]

df_points.sample(5)

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
409951,2017,5,12,6,18,1404,140.0,435,35
489371,2018,1,11,3,14,2744,274.0,489,40
876850,2018,7,5,5,10,1530,153.0,677,55
255718,2017,8,5,4,9,1269,126.0,424,34
986551,2017,9,15,4,19,3762,376.0,430,35

### Customers Loyalty History

In [41]:
df_customers = pd.read_csv('../data/raw/Customer_Loyalty_History.csv', index_col=0)

df_customers.head()

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN